Revit 2027 API
KeyBasedTreeEntriesLoadResults.GetFailureMessages Method
 Get all error or warnings created while attempting to load KeyBasedTreeEntries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureMessage> GetFailureMessages()
Public Function GetFailureMessages As IList(Of FailureMessage)
public:
IList<FailureMessage^>^ GetFailureMessages()
member GetFailureMessages : unit -> IList<FailureMessage>
Return Value
IList<FailureMessage>
 A collection of FailureMessage objects, if any errors or warnings were encountered while loading and building the KeyBasedTreeEntries.
Remarks
Revit does not post these warnings. They are provided as a convenience to the API user, who may wish to post them.
The information in the warnings is also captured in the other error functions of KeyBasedTreeEntriesLoadResults.
See Also
Reference
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace